# IsTextStyleByClass

## Description
Procedure IsTextStyleByClass returns whether the class text style is used for the referenced object.

```pascal
FUNCTION IsTextStyleByClass(objectId : HANDLE) : BOOLEAN;
```

```python

def vs.IsTextStyleByClass(objectId):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectId|HANDLE|handle to object|

## See Also
VS Functions:
SetTextStyleRef| GetTextStyleRef| SetTextStyleRefN| GetTextStyleRefN| SetTextStyleByClass| SetTextStyleByClassN| IsTextStyleByClass| IsTextStyleByClassN

## Version
Availability: from Vectorworks 2015
## Category
* Object Attributes